УТ_для_edt/src/Catalogs/CRM_СостоянияСобытий/CRM_СостоянияСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияСобытий</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Запланировано</name>
      <description>Запланировано</description>
    </items>
    <items>
      <name>Отменено</name>
      <description>Отменено</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСостояния</name>
    <type>
      <types>EnumRef.CRM_ТипыСостоянийСобытий</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Enums/CRM_ТипыСостоянийСобытий/CRM_ТипыСостоянийСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ТипыСостоянийСобытий</name>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_СостоянияСобытий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить элементы справочника
//  Процедура заполняет тип состояния элемента справочника CRM_СостоянияСобытий.
//
Процедура ЗаполнитьЭлементыСправочника() Экспорт
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияСобытий
	|ГДЕ
	|	ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.ПустаяСсылка)
	|");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если Объект.Предопределенный Тогда
			Попытка Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий[Справочники.CRM_СостоянияСобытий.ПолучитьИмяПредопределенного(Выборка.Ссылка)];
			Исключение КонецПопытки;
			Если Не ЗначениеЗаполнено(Объект.ТипСостояния) Тогда
				Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий.ВРаботе;
			КонецЕсли;
		Иначе
			Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий.ВРаботе;
		КонецЕсли;
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#КонецЕсли
